// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область Печать

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Заявление на возврат товаров
	КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.ПечатьЗаявленияНаВозвратТоваровОтКлиента";
	КомандаПечати.Идентификатор = "ит_ПечатьСпецификации";
	КомандаПечати.Представление = НСтр("ru = 'Печать спецификации'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ит_ПечатьСпецификации") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ит_ПечатьСпецификации", 
			НСтр("ru = 'Печать спецификации'"), 
			СформироватьПечатнуюФормуСпецификации(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
		
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры 

Функция СформироватьПечатнуюФормуСпецификации(МассивОбъектов, ОбъектыПечати)

	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ит_Спецификация";
	
	Для Каждого Док Из МассивОбъектов Цикл
	
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ит_СпецификацияКДоговоруПоставщика.ПечатьСпецификацииПоставщика");
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

		
		ОбластьЗаголовок.Параметры.Документ = Строка("Спецификация № " + Док.Номер + " от " + Формат(Док.Дата, "ДФ=dd.MM.yyyy"));
		ОбластьЗаголовок.Параметры.Примечание = Строка(Док.Комментарий);
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапка); 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ит_СпецификацияСпецификация.НомерСтроки КАК НомерПП,
			|	ит_СпецификацияСпецификация.Номенклатура КАК Товар,
			|	ит_СпецификацияСпецификация.НоваяРозничнаяЦенаСНДС КАК ЦенаРозничнаяНоваяС_НДС,
			|	ит_СпецификацияСпецификация.ЦенаПоПрошлойСпецификации КАК ЦенаРозничнаяСтараяС_НДС,
			|	ит_СпецификацияСпецификация.ЦенаТекущаяСНДС КАК ЦенаПриходаНоваяС_НДС,
			|	ит_СпецификацияСпецификация.ЦенаТекущаяБезНДС КАК ЦенаПриходаНоваяБезНДС,
			|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Остаток,
			|	ит_СпецификацияСпецификация.Номенклатура.ит_КодЦБ КАК КодЦБ,
			|	ит_СпецификацияСпецификация.Номенклатура.СтавкаНДС.Ставка КАК СтавкаНДС,
			|	ит_СпецификацияСпецификация.Наценка КАК ПроцентНаценки
			|ИЗ
			|	Документ.ит_СпецификацияКДоговоруПоставщика.Спецификация КАК ит_СпецификацияСпецификация
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
			|				&Дата,
			|				(Номенклатура, Характеристика) В
			|					(ВЫБРАТЬ
			|						ит_СпецификацияСпецификация.Номенклатура КАК Номенклатура,
			|						ит_СпецификацияСпецификация.Характеристика КАК Характеристика
			|					ИЗ
			|						Документ.ит_Спецификация.Спецификация КАК ит_СпецификацияСпецификация
			|					ГДЕ
			|						ит_СпецификацияСпецификация.Ссылка = &Ссылка)) КАК ТоварыНаСкладахОстатки
			|		ПО ит_СпецификацияСпецификация.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
			|			И ит_СпецификацияСпецификация.Характеристика = ТоварыНаСкладахОстатки.Характеристика
			|ГДЕ
			|	ит_СпецификацияСпецификация.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Дата", Док.Дата);
		Запрос.УстановитьПараметр("Ссылка", Док);
		
		//ЦенаРозничнаяСтараяС_НДС
		//ЦенаРозничнаяНоваяС_НДС
		//ЦенаПриходаСтараяБезНДС 
		//ЦенаПриходаСтараяС_НДС 
		//ЦенаПриходаНоваяБезНДС 
		//ЦенаПриходаНоваяС_НДС
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
			
		Пока Выборка.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			
			Если ЗначениеЗаполнено(Выборка.СтавкаНДС) Тогда
			
				Если Док.ЦенаПоставщикаВключаетНДС Тогда
					ОбластьСтрока.Параметры.ЦенаПриходаНоваяБезНДС = ОбластьСтрока.Параметры.ЦенаПриходаНоваяС_НДС; 
				Иначе
					ОбластьСтрока.Параметры.ЦенаПриходаНоваяБезНДС = ОбластьСтрока.Параметры.ЦенаПриходаНоваяС_НДС 
																/ (1 + (ОбластьСтрока.Параметры.СтавкаНДС * 0.01));
				КонецЕсли;
				
				Если Док.ЦенаПоставщикаВключаетНДС Тогда
					ОбластьСтрока.Параметры.ЦенаПриходаСтараяБезНДС = ОбластьСтрока.Параметры.ЦенаПриходаСтараяС_НДС;
				Иначе
					ОбластьСтрока.Параметры.ЦенаПриходаСтараяБезНДС = ОбластьСтрока.Параметры.ЦенаПриходаСтараяС_НДС 
																/ (1 + (ОбластьСтрока.Параметры.СтавкаНДС * 0.01));
				КонецЕсли;
			КонецЕсли;															
														
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		  
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;	
		
	ТабличныйДокумент.АвтоМасштаб = Истина;	
		
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуСпецификации()

Функция ДоступныеДляШаблоновПечатныеФормы() Экспорт
	
	МассивДоступныхПечатныхФорм = Новый Массив;
	
	Возврат МассивДоступныхПечатныхФорм

КонецФункции

#КонецОбласти
#КонецЕсли