
Функция ШаблонURL1GET(Запрос)
	//Ответ = Новый HTTPСервисОтвет(200);
	
	Токен = Константы.ТокенДляJIRAВBASE64.Получить();
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;

	Соединение = Новый HTTPСоединение("testtodolist.atlassian.net",443,,,,30,SSL);
	
	АдресРесурса = "/rest/api/2/search";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8"); 
	Заголовки.Вставить("Authorization", "Basic "+ Токен); 
	
	ЗапросСЗаголовками = Новый HTTPЗапрос(АдресРесурса,Заголовки);
	
	Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросСЗаголовками);
	
	Если Ответ.КодСостояния = 200 Тогда
		
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		
		ДанныеСоответствия = ПрочитатьJSON(ЧтениеJSON, Истина); 
		Возврат  ДанныеСоответствия
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не удалось выполнить запрос, код состояния %1", Ответ.КодСостояния);
		Сообщение.Сообщить();
		Возврат Сообщение
	КонецЕсли
	//Возврат Ответ;
КонецФункции
