	
&Вместо("ОбработкаПроведения")
Процедура ИТ4_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Регистр ЦеныНоменклатуры	
	НаборЗаписейЦены = РегистрыСведений.ит_ЦеныНоменклатурыКонкурентов.СоздатьНаборЗаписей();
	НаборЗаписейЦены.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейЦены.Прочитать();
	НаборЗаписейЦены.Очистить();
	
	ВидЦены     = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Формат, "ит_ВидЦенКонкурентов");
		
	Для Каждого Стр Из ЦеныКонкурента Цикл
		
		Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			
			ЗаписьЦены = НаборЗаписейЦены.Добавить();
			ЗаписьЦены.Период 			= Дата;
			ЗаписьЦены.Конкурент 		= Конкурент;
			ЗаписьЦены.Номенклатура 	= Стр.Номенклатура;
            ЗаписьЦены.ВидЦены          = ВидЦены;
			Записьцены.Цена 			= Стр.Цена;
			ЗаписьЦены.Валюта 			= Константы.ВалютаРегламентированногоУчета.Получить();
			
			Если НЕ ЗначениеЗаполнено(Стр.СрокДействия) Тогда 
				ЗаписьЦены.СрокДействия     = 30;
			Иначе
				ЗаписьЦены.СрокДействия     = Стр.СрокДействия;
			КонецЕсли;

		КонецЕсли;
			
	КонецЦикла;
	
	Попытка
		НаборЗаписейЦены.Записать();	
	Исключение                                               
	    Сообщить("Не удалось записать цены номенклатуры: " + ОписаниеОшибки());
	КонецПопытки;
	
	ПродолжитьВызов(Отказ, РежимПроведения);
	
КонецПроцедуры




